# В программировании обозначает область программы, 
# в пределах которой идентификатор (имя) некоторой переменной 
# продолжает быть 
# связанным с этой переменной и возвращать её значение

# За пределами области видимости тот же самый идентификатор 
# может быть связан с другой переменной, либо 
# быть свободным (не связанным ни с какой из них).

# Локальные переменные - внутри функции,
# глобальные внутри основного кода
# внутри функции видно переменные объявленные 
# выше в основном коде или в открывающих функциях
